Lunerio/PAVApp/libraries/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_STM32_WM.h
const char ESP_AT_FLDSET_START[]  /*PROGMEM*/ = "<fieldset>";
const char ESP_AT_FLDSET_END[]    /*PROGMEM*/ = "</fieldset>";
const char ESP_AT_HTML_PARAM[]    /*PROGMEM*/ = "<div><label>{b}</label><input value='[[{v}]]'id='{i}'><div></div></div>";
const char ESP_AT_HTML_BUTTON[]   /*PROGMEM*/ = "<button onclick=\"sv()\">Save</button></div>";

const char ESP_AT_HTML_SCRIPT[]   /*PROGMEM*/ = "<script id=\"jsbin-javascript\">\
function udVal(key,val){var request=new XMLHttpRequest();var url='/?key='+key+'&value='+encodeURIComponent(val);\
request.open('GET',url,false);request.send(null);}\
function sv(){udVal('id',document.getElementById('id').value);udVal('pw',document.getElementById('pw').value);\
udVal('id1',document.getElementById('id1').value);udVal('pw1',document.getElementById('pw1').value);\
udVal('sv',document.getElementById('sv').value);udVal('tk',document.getElementById('tk').value);";

const char ESP_AT_HTML_SCRIPT_ITEM[]  /*PROGMEM*/ = "udVal('{d}',document.getElementById('{d}').value);";
const char ESP_AT_HTML_SCRIPT_END[]   /*PROGMEM*/ = "alert('Updated');}</script>";
const char ESP_AT_HTML_END[]          /*PROGMEM*/ = "</html>";

//////////////////////////////////////////////

String IPAddressToString(IPAddress _address)
{
  String str = String(_address[0]);
  str += ".";
  str += String(_address[1]);
  str += ".";
  str += String(_address[2]);
  str += ".";
  str += String(_address[3]);
  return str;
}

//////////////////////////////////////////////

class BlynkTransportShieldEsp8266
{
    static void onData(uint8_t mux_id, uint32_t len, void* ptr) 
    {
      ((BlynkTransportShieldEsp8266*)ptr)->onData(mux_id, len);
    }
    
    //////////////////////////////////////////////

    void onData(uint8_t mux_id, uint32_t len) 
    {
      if (mux_id != BLYNK_ESP8266_MUX) 
      {
        return;
      }

      //KH
#if (SIMPLE_SHIELD_ESP8266_DEBUG > 1)
      BLYNK_LOG4("Got:", len, ",Free:", buffer.free());
#endif
      //

      if ( (uint32_t) buffer.free() < len)
      {
        //KH
#if (SIMPLE_SHIELD_ESP8266_DEBUG > 0)
        BLYNK_LOG4("OVF,Got:", len, ",Free:", buffer.free());
#endif

        return;
      }
      
      while (len) 
      {
        if (client->getUart()->available()) 
        {
          uint8_t b = client->getUart()->read();
          //KH
          // len got from +IPD data
          buffer.put(b);
          //
          len--;
        }
      }
      
      //KH
#if (SIMPLE_SHIELD_ESP8266_DEBUG > 1)
      BLYNK_LOG2(BLYNK_F("onData Buffer len"), len );
#endif
      //
    }
    
    //////////////////////////////////////////////

  public:
    BlynkTransportShieldEsp8266()
      : client(NULL)
      , status(false)
      , domain(NULL)
      , port(0)
    {}
    
    //////////////////////////////////////////////

    void setEsp8266(ESP8266* esp8266) 
    {
      client = esp8266;
      client->setOnData(onData, this);
    }
    
    //////////////////////////////////////////////

    //TODO: IPAddress

    void begin(const char* d,  uint16_t p) 
    {
      domain = d;
      port = p;
    }
    
    //////////////////////////////////////////////

    bool connect() 
    {
      if (!domain || !port)
        return false;
      status = client->createTCP(BLYNK_ESP8266_MUX, domain, port);
      return status;
    }
    
    //////////////////////////////////////////////

    void disconnect() 
    {
      status = false;
      buffer.clear();
      client->releaseTCP(BLYNK_ESP8266_MUX);
    }
    
    //////////////////////////////////////////////

    size_t read(void* buf, size_t len)
    {
      millis_time_t start = BlynkMillis();
      //KH
      //buffer.size() is number of bytes currently still in FIFO buffer
      //Check to see if all data are read or not

#if (SIMPLE_SHIELD_ESP8266_DEBUG > 1)
      BLYNK_LOG4("rd:len=", len, ",Buf=", buffer.size());
#endif

      while ((buffer.size() < len) && (BlynkMillis() - start < 1500))
      {
        // Actually call ESP8266 run/rx_empty (read and locate +IPD, know data len,
        // then call onData() to get len bytes of data to buffer => BlynkProtocol::ProcessInput()
        client->run();
      }
      //All data got in FIFO buffer, copy to destination buf and return len
      return buffer.get((uint8_t*)buf, len);
    }
    
    //////////////////////////////////////////////

    size_t write(const void* buf, size_t len) 
    {
      if (client->send(BLYNK_ESP8266_MUX, (const uint8_t*)buf, len)) 
      {
        return len;
      }
      
      return 0;
    }
    
    //////////////////////////////////////////////

    bool connected() 
    {
      return status;
    }
    
    //////////////////////////////////////////////

    int available()
    {
      client->run();
#if (SIMPLE_SHIELD_ESP8266_DEBUG > 2)
      BLYNK_LOG2("Still:", buffer.size());
#endif
      return buffer.size();
    }
    
    //////////////////////////////////////////////

  private:
    ESP8266* client;
    bool status;

    //KH
#if BLYNK_ESP8266_AT_USE_STM32
  #if defined(STM32F0)
    // For STM32 F0
    BlynkFifo<uint8_t, 512> buffer;
    #error Board STM32F0 not supported
  #elif defined(STM32F1)
    // For STM32 F1
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32F1 uses 1K FIFO buffer
  #elif defined(STM32F2)
    // For STM32 F2
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32F2 uses 1K FIFO buffer
  #elif defined(STM32F3)
    // For STM32 F3
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32F3 uses 1K FIFO buffer
  #elif defined(STM32F4)
    // For STM32 F4
    BlynkFifo<uint8_t, 2048> buffer;
    #warning Board STM32F4 uses 2K FIFO buffer
  #elif defined(STM32F7)
    // For STM32 F7
    BlynkFifo<uint8_t, 4096> buffer;
    #warning Board STM32F7 uses 4K FIFO buffer
  #elif defined(STM32L0)
    // For STM32 L0
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32L0 uses 1K FIFO buffer
  #elif defined(STM32L1)
    // For STM32 L1
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32L1 uses 1K FIFO buffer
  #elif defined(STM32L4)
    // For STM32 L4
    BlynkFifo<uint8_t, 2048> buffer;
    #warning Board STM32L4 uses 2K FIFO buffer
  #elif defined(STM32H7)
    // For STM32 H7
    BlynkFifo<uint8_t, 4096> buffer;
    #warning Board STM32H7 uses 4K FIFO buffer
  #elif defined(STM32G0)
    // For STM32 G0
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32G0 uses 1K FIFO buffer
  #elif defined(STM32G4)
    // For STM32 G4
    BlynkFifo<uint8_t, 2048> buffer;
    #warning Board STM32G4 uses 2K FIFO buffer
  #elif defined(STM32WB)
    // For STM32WB
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32WB uses 1K FIFO buffer
  #elif defined(STM32MP1)
    // For STM32MP1
    BlynkFifo<uint8_t, 1024> buffer;
    #warning Board STM32MP1 uses 1K FIFO buffer

  #else
    // For STM32 Unknow
    BlynkFifo<uint8_t, 512> buffer;
    #warning Board STM32 unknown uses 512bytes FIFO buffer
  #endif

#else
  // For other AVR Mega
  //BlynkFifo<uint8_t,256> buffer;
  // For MeGa 2560 or 1280
  BlynkFifo<uint8_t, 512> buffer;
  #warning Not STM32 board => uses 512bytes FIFO buffer
#endif

    const char* domain;
    uint16_t    port;
};

//////////////////////////////////////////////

class BlynkWifi
  : public BlynkProtocol<BlynkTransportShieldEsp8266>
{
    typedef BlynkProtocol<BlynkTransportShieldEsp8266> Base;
    
